# โปรแกรมคำนวณจำนวนกระเบื้องสำหรับปูพื้น

กว้างพื้น = float(input("กรอกความกว้างของพื้น (เมตร): "))
ยาวพื้น = float(input("กรอกความยาวของพื้น (เมตร): "))

กว้างกระเบื้อง = float(input("กรอกความกว้างของกระเบื้อง (เมตร): "))
ยาวกระเบื้อง = float(input("กรอกความยาวของกระเบื้อง (เมตร): "))

พื้นที่พื้น = กว้างพื้น * ยาวพื้น
พื้นที่กระเบื้อง = กว้างกระเบื้อง * ยาวกระเบื้อง

จำนวนกระเบื้อง = พื้นที่พื้น / พื้นที่กระเบื้อง

print("-------------------------")
print("พื้นที่พื้น =", พื้นที่พื้น, "ตารางเมตร")
print("พื้นที่กระเบื้อง =", พื้นที่กระเบื้อง, "ตารางเมตร")
print("จำนวนกระเบื้องที่ต้องใช้ =", จำนวนกระเบื้อง, "แผ่น")